app/views/shared/index.html.erb


      <%- flux.items.each do |item| %>
---
SELECT `items`.* FROM `items` WHERE `items`.`flux_id` = 5