app/controllers/fluxes_controller.rb

SELECT `fluxes`.* FROM `fluxes`
---
  def index
    @fluxes = Flux.all

SELECT `fluxes`.* FROM `fluxes` WHERE `fluxes`.`id` = 1 LIMIT 1
---
  def show
    @flux = Flux.find(params[:id])

INSERT INTO `fluxes` (`created_at`, `titre`, `updated_at`, `url`) VALUES ('2013-01-31 20:49:37', 'PirateBay', '2013-01-31 20:49:37', 'http://rss.thepiratebay.se/200')
---
  def create
    @flux = Flux.new(params[:flux])

    if @flux.save

SELECT `fluxes`.* FROM `fluxes` WHERE `fluxes`.`id` = 2 LIMIT 1
DELETE FROM `fluxes` WHERE `fluxes`.`id` = 1
---
  def destroy
    @flux = Flux.find(params[:id])
    @flux.destroy