app/controllers/shared_controller.rb

	def index
		@fluxes = Flux.all
		@items = Item.all
---
SELECT `fluxes`.* FROM `fluxes`
SELECT `items`.* FROM `items`